sdaiGetComplexEntityBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**)
\details
Complex instance will be created within parent schema if such combination doesn't exist.
\param schemaName   [in] name of the schema.
\param nameNumber   [in] count of names.
\param nameVector   [in] names array of members of complex entities.
\returns a valid SdaiEntity if succeded, otherwise return nullptr.